# Совместимость версий

Узнайте, какая функциональность доступна в более старых версиях языка.

Эта книга описывает Swift 5.10,
стандартную версию Swift, включенную в Xcode 15.3.
Вы можете использовать Xcode 15.3 для сборки целей,
написанных как на Swift 5.10, так и на Swift 4.2 или Swift 4.

Когда вы используете Xcode 15.3 для сборки кода Swift 4 и Swift 4.2,
большинство функциональности Swift 5.10 доступно.
Тем не менее следующие изменения доступны только для кода, 
который использует версию 5.10 или более позднюю:

- Функции, возвращающие непрозрачный тип, требуют выполнения Swift 5.1.
- Выражение `try?` не добавляет дополнительного уровня опциональности
  для выражений, которые уже возвращают опционалы.
- Инициализационные выражения с большими литералами целых чисел выводятся
  как правильный тип целого числа.
  Например, `UInt64(0xffff_ffff_ffff_ffff)` оценивается как правильное значение,
  а не как переполнение.

Конкурентность в Swift доступна начиная с версии 5.10 или более поздней,
а также версии стандартной библиотеки Swift,
которая предоставляет соответствующие типы конкурентности.
На платформах Apple установите целевую версию
не ниже iOS 13, macOS 10.15, tvOS 13 или watchOS 6.
 
Код, написанный для версии 5.10, может использовать
код, написанный на Swift 4.2 или Swift 4,
и наоборот.
Это означает, что в больших проектах,
разделенных на несколько частей,
вы можете постепенно обновлять код с Swift 4 на 5.10,
не меняя сразу всего проекта.

<!--
Этот исходный файл является частью проекта с открытым исходным кодом Swift.org

Авторские права (c) 2014 - 2022 Apple Inc. и авторы проекта Swift
Лицензировано по Apache License v2.0 с исключением из библиотеки выполнения

См. https://swift.org/LICENSE.txt для информации о лицензии
См. https://swift.org/CONTRIBUTORS.txt для списка авторов проекта Swift
-->
